app/controllers/names_controller.rb

SELECT * FROM "names"
---
  def index
    @names = Name.all